create_timing_netlist
read_sdc
update_timing_netlist
report_clocks
report_timing -npath 50